I tried to run `tf plan` so that I could check/review/merge this, but ran into issues.

I followed the guidelines here to get CLI access to the AWS project in order to make terraform changes: https://infrastructure.2i2c.org/topic/access-creds/cloud-auth/#cloud-access-aws-iam-terminal

Output of plan has difficulty reading certain resources:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_policy.extra_user_policy["prod"] will be created
  + resource "aws_iam_policy" "extra_user_policy" {
      + arn         = (known after apply)
      + description = "Extra permissions granted to users on hub prod on nasa-ghg-hub"
      + id          = (known after apply)
      + name        = "nasa-ghg-hub-prod-extra-user-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:AbortMultipartUpload",
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:GetBucketLocation",
                          + "s3:ListMultipartUploadParts",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::ghgc-data-staging",
                          + "arn:aws:s3:::ghgc-data-staging/*",
                          + "arn:aws:s3:::ghgc-data-store-dev",
                          + "arn:aws:s3:::ghgc-data-store-dev/*",
                          + "arn:aws:s3:::ghgc-data-store",
                          + "arn:aws:s3:::ghgc-data-store/*",
                          + "arn:aws:s3:::ghgc-data-store-staging",
                          + "arn:aws:s3:::ghgc-data-store-staging/*",
                          + "arn:aws:s3:::veda-data-store-staging",
                          + "arn:aws:s3:::veda-data-store-staging/*",
                          + "arn:aws:s3:::lp-prod-protected",
                          + "arn:aws:s3:::lp-prod-protected/*",
                          + "arn:aws:s3:::gesdisc-cumulus-prod-protected",
                          + "arn:aws:s3:::gesdisc-cumulus-prod-protected/*",
                          + "arn:aws:s3:::nsidc-cumulus-prod-protected",
                          + "arn:aws:s3:::nsidc-cumulus-prod-protected/*",
                          + "arn:aws:s3:::ornl-cumulus-prod-protected",
                          + "arn:aws:s3:::ornl-cumulus-prod-protected/*",
                        ]
                    },
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.extra_user_policy["staging"] will be created
  + resource "aws_iam_policy" "extra_user_policy" {
      + arn         = (known after apply)
      + description = "Extra permissions granted to users on hub staging on nasa-ghg-hub"
      + id          = (known after apply)
      + name        = "nasa-ghg-hub-staging-extra-user-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:AbortMultipartUpload",
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:GetBucketLocation",
                          + "s3:ListMultipartUploadParts",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::ghgc-data-staging",
                          + "arn:aws:s3:::ghgc-data-staging/*",
                          + "arn:aws:s3:::ghgc-data-store-dev",
                          + "arn:aws:s3:::ghgc-data-store-dev/*",
                          + "arn:aws:s3:::ghgc-data-store",
                          + "arn:aws:s3:::ghgc-data-store/*",
                          + "arn:aws:s3:::ghgc-data-store-staging",
                          + "arn:aws:s3:::ghgc-data-store-staging/*",
                          + "arn:aws:s3:::veda-data-store-staging",
                          + "arn:aws:s3:::veda-data-store-staging/*",
                          + "arn:aws:s3:::lp-prod-protected",
                          + "arn:aws:s3:::lp-prod-protected/*",
                          + "arn:aws:s3:::gesdisc-cumulus-prod-protected",
                          + "arn:aws:s3:::gesdisc-cumulus-prod-protected/*",
                          + "arn:aws:s3:::nsidc-cumulus-prod-protected",
                          + "arn:aws:s3:::nsidc-cumulus-prod-protected/*",
                          + "arn:aws:s3:::ornl-cumulus-prod-protected",
                          + "arn:aws:s3:::ornl-cumulus-prod-protected/*",
                          + "arn:aws:s3:::podaac-ops-cumulus-public",
                          + "arn:aws:s3:::podaac-ops-cumulus-public/*",
                          + "arn:aws:s3:::podaac-ops-cumulus-protected",
                          + "arn:aws:s3:::podaac-ops-cumulus-protected/*",
                        ]
                    },
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ eksctl_iam_command = <<-EOT
        eksctl create iamidentitymapping \
           --cluster nasa-ghg-hub \
           --region us-west-2 \
      -    --arn arn:aws:iam::597746869805:user/hub-continuous-deployer \
      +    --arn arn:aws:iam::444055461661:user/hub-continuous-deployer \
           --username hub-continuous-deployer  \
           --group system:masters
    EOT
╷
│ Error: reading Amazon S3 (Simple Storage) Bucket (nasa-ghg-hub-scratch): Forbidden: Forbidden
│       status code: 403, request id: SS6X99744RSCE2CF, host id: 3MlFu9S2HMpIbkP1gZRtvff0oNFhZEEp1Xt/KUmJDh+Y/hSMnn4VWFg8z9cCSOQRKXv1AZHNieA=
│ 
│   with aws_s3_bucket.user_buckets["scratch"],
│   on buckets.tf line 1, in resource "aws_s3_bucket" "user_buckets":
│    1: resource "aws_s3_bucket" "user_buckets" {
│ 
╵
╷
│ Error: reading Amazon S3 (Simple Storage) Bucket (nasa-ghg-hub-scratch-staging): Forbidden: Forbidden
│       status code: 403, request id: SS6K0F15S04JZBTK, host id: 3JhyAazRRyMj23GrISXVZ3IKEV4UiGkGdUsZx8d5eSIhIiBxCq77ypuQO0pGtf+4keFLxD7ZDR4=
│ 
│   with aws_s3_bucket.user_buckets["scratch-staging"],
│   on buckets.tf line 1, in resource "aws_s3_bucket" "user_buckets":
│    1: resource "aws_s3_bucket" "user_buckets" {
│ 
╵
╷
│ Error: error getting S3 Bucket Lifecycle Configuration (nasa-ghg-hub-scratch): AccessDenied: Access Denied
│       status code: 403, request id: 1RV9997J5XM43KS1, host id: N6RQUuN74LHe6ibxaTMivZJLN7JNccZzDtPiKIE3YbILNsSESJKkctOCLUFjZvpElxEMENy+jb4=
│ 
│   with aws_s3_bucket_lifecycle_configuration.user_bucket_expiry["scratch"],
│   on buckets.tf line 7, in resource "aws_s3_bucket_lifecycle_configuration" "user_bucket_expiry":
│    7: resource "aws_s3_bucket_lifecycle_configuration" "user_bucket_expiry" {
│ 
╵
╷
│ Error: error getting S3 Bucket Lifecycle Configuration (nasa-ghg-hub-scratch-staging): AccessDenied: Access Denied
│       status code: 403, request id: 1RVD8ZKF9M97MJ2W, host id: MgWOCIJ+9SN/OAxIk9UGHeBCX4IC/Cq+wx8hd8oHyicSHGBTjNhUq+sxLEaUE6GrKLLano2S15c=
│ 
│   with aws_s3_bucket_lifecycle_configuration.user_bucket_expiry["scratch-staging"],
│   on buckets.tf line 7, in resource "aws_s3_bucket_lifecycle_configuration" "user_bucket_expiry":
│    7: resource "aws_s3_bucket_lifecycle_configuration" "user_bucket_expiry" {
│ 
╵
╷
│ Error: reading IAM Access Key (AKIAYWLD5MYWZERLF4UP): AccessDenied: User: arn:aws:iam::444055461661:user/sgibson is not authorized to perform: iam:ListAccessKeys on resource: user hub-continuous-deployer with an explicit deny in an identity-based policy
│       status code: 403, request id: ccf87511-c23a-4dbd-870e-f2c1115d9a68
│ 
│   with aws_iam_access_key.continuous_deployer,
│   on cd.tf line 6, in resource "aws_iam_access_key" "continuous_deployer":
│    6: resource "aws_iam_access_key" "continuous_deployer" {
│ 
╵
╷
│ Error: reading EFS file system (fs-09bd18b3ca23eefa2): AccessDeniedException: User: arn:aws:iam::444055461661:user/sgibson is not authorized to perform: elasticfilesystem:DescribeFileSystems on the specified resource
│       status code: 403, request id: b4f8c81f-2b1f-4650-bc0e-a4257f6f7441
│ 
│   with aws_efs_file_system.homedirs,
│   on efs.tf line 44, in resource "aws_efs_file_system" "homedirs":
│   44: resource "aws_efs_file_system" "homedirs" {
│ 
╵
╷
│ Error: reading EKS Cluster (nasa-ghg-hub): AccessDeniedException: User: arn:aws:iam::444055461661:user/sgibson is not authorized to perform: eks:DescribeCluster on resource: arn:aws:eks:us-west-2:444055461661:cluster/nasa-ghg-hub with an explicit deny
│ 
│   with data.aws_eks_cluster.cluster,
│   on main.tf line 34, in data "aws_eks_cluster" "cluster":
│   34: data "aws_eks_cluster" "cluster" {
```

I think the changes are fine, but I won't be able to apply them